{"meta":{"title":"zhengtuqiang's Blog","subtitle":"code change world","description":"the place where zhengtuqiang to write something","author":"郑土强","url":"http://yoursite.com"},"pages":[],"posts":[{"title":"Hello World","slug":"hello-world","date":"2018-07-22T16:35:05.000Z","updated":"2018-07-22T16:35:09.624Z","comments":true,"path":"2018/07/23/hello-world/","link":"","permalink":"http://yoursite.com/2018/07/23/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[{"name":"Diary","slug":"Diary","permalink":"http://yoursite.com/categories/Diary/"}],"tags":[{"name":"PS3","slug":"PS3","permalink":"http://yoursite.com/tags/PS3/"},{"name":"Games","slug":"Games","permalink":"http://yoursite.com/tags/Games/"}]},{"title":"掘金翻译指北","slug":"掘金翻译之十万个为什么","date":"2018-07-22T16:35:05.000Z","updated":"2018-07-22T16:39:26.606Z","comments":true,"path":"2018/07/23/掘金翻译之十万个为什么/","link":"","permalink":"http://yoursite.com/2018/07/23/掘金翻译之十万个为什么/","excerpt":"","text":"一切为了翻译，为了一切翻译，为了翻译一切。 目录 翻译 认领翻译任务时有没有条件限制 能否认领擅长领域之外的文章 能否同时认领多篇文章 和校对意见有冲突怎么办？ 译文需要保留英文原文么？ 代码中的注释需要翻译么？ 如果被反馈译文质量太差会有什么后果？ 校对 认领校对任务时有没有领域限制 能否提前预约校对任务 校对任务的具体内容都有哪些 如果发现译文质量太差怎么办 兑换奖品 在哪里能够兑换奖品 翻译认领翻译任务时有没有条件限制 有。主要是为了保证翻译质量和协作效率，主要有以下条件： 已经翻译或是至少参与校对过一篇文章 认领翻译的文章必须在自己擅长的分类之内 能否认领擅长领域之外的文章 对不起，不能。 能否同时认领多篇文章 原则上是没有数量限制的，但是要注意每篇文章的时间限制和翻译质量哟。需要注意的是，完成之后提 PR 的时候，一个 PR 只能有一篇文章，切勿两篇或多篇合并到一个 PR。 和校对意见有冲突怎么办 如果出现和校对意见有冲突的话，可以 @ 另外一个校对者参与讨论，综合意见进行修改。如果仍然无法统一意见，请 @ 管理员 leviding 参与。 译文需要保留英文原文么 不需要。 代码中的注释需要翻译么 是的，需要。 如果被反馈译文质量太差会有什么后果 如果一篇译文被反馈译文质量太差，我们会启动复核程序，如果确认质量过差，首次会采取如下惩罚措施： 一个月内禁止领取任务，并取消其获取该篇文章的翻译积分资格 积分将平分给两位校对者，由两位校对者负责翻译和改进文章的翻译质量 再犯则直接取消其翻译资格。哼╭(╯^╰)╮ 校对认领校对任务时有没有领域限制 原则上来说，认领校对任务是没有任何限制的哈~ 但是还是建议大家尽量选择自己比较擅长的领域内的文章进行校对撒。这样才能保证校对质量哟~ p( ^ O ^ )q 理解万岁！ 能否提前预约校对任务 对不起，不能。校对任务只能在译文对应的 PR 下进行申请。 校对任务的具体内容都有哪些 校对者肩负着把控文章翻译质量的重任，除了需要校对译文的语句是否流畅、意思是否准确充分表达、专业术语的翻译是否符合业内约定译法之外，还需要校对译文是否符合 排版规范，用词是否得当等。具体内容包括但不限于： 译文的意思是否可以解读 译文的意思可以解读，但是与原文意思是否一致 专业术语翻译是否错误（所谓翻译错误，主要指冒用了其他术语的约定译法、容易引起读者误解的译文。无约定译法的应当尝试翻译 + 英文原文标注的方式） 专业术语前后翻译是否一致 是否存在错别字，包括“的得地”的误用 译文意思正确，但是读起来是否别扭，是否存在生硬英文标点符号以及无意义的空格 是否英文大小写及专有名词大小写错误 如果发现译文质量太差怎么办 目前来说，尽管要求大家在认领译文的时候只选择自己最擅长的领域，但是主要还是需要大家靠自觉来保证译文的翻译质量，如果在校对过程中发现译文存在（包括但不限于）以下问题时，请及时联系管理员 LeviDing 哈~ 译文的意思无法解读 译文多处存在明显语句不通顺的现象或有机器翻译嫌疑 专业术语存在多处的翻译错误 兑换奖品在哪里能够兑换奖品 如需兑换奖品请在群内联系管理员即可。 掘金翻译计划译者教程： 如何参与翻译 如何提交翻译以及后续更新 如何参与校对及校对的正确姿势 文章分享到掘金指南 译文排版规则指北 十万个为什么","categories":[{"name":"翻译","slug":"翻译","permalink":"http://yoursite.com/categories/翻译/"}],"tags":[{"name":"翻译","slug":"翻译","permalink":"http://yoursite.com/tags/翻译/"},{"name":"指南","slug":"指南","permalink":"http://yoursite.com/tags/指南/"}]},{"title":"老婆我爱你","slug":"老婆我爱你","date":"2018-07-22T15:56:15.000Z","updated":"2018-07-22T17:00:01.282Z","comments":true,"path":"2018/07/22/老婆我爱你/","link":"","permalink":"http://yoursite.com/2018/07/22/老婆我爱你/","excerpt":"","text":"小悦，My love：遇到你的时候觉得你是个单纯的姑娘性格好人又长得漂亮于是我喜欢上你了把你看做心中的女神前世一定是拯救了世界才能在有生的瞬间能遇到你 还记得那天外婆给你来电说是介绍个对象给你我慌了不想被别人捷足先登于是我们第一次通了电话没有担心中的见外反而意外的合拍那一次我们达成了通话100+分钟的成就 后来每分钟都与你挥霍让我感动的是能对共同的事有笑意得到认同 转折在4天后“今晚夸了你很多”这句话是我听过最好的情话与此同时你是在一个伤感的状态我见不得心爱的人伤心我鼓起勇气抱着我不想和你做普通朋友的心态一鼓作气向你表白 结果上天从来不会亏待努力的人越努力越幸运你的格言也是我的格言 一开始你总是不肯轻易说爱大概是怕经不起失望吧我不管你信不信我就是要表达爱我就是要说出来总比你误会总比你理解得有偏差的要好跟你一起很舒心有种自然而然的感觉 但是我现在不在你身边你要好好照顾自己幸福虽然迟到但是总会到来异地恋每次见面的时候都好像重新恋爱一次一样每次重逢的那种喜悦是那些每天腻在一起早就腻歪了的情侣没法体会的 这也是空间上时间上某种程度而言的考验 小悦你 若不离不弃我 便生死相依你 许我一生一世我 许你不离不弃 by 小兔崽子","categories":[],"tags":[]},{"title":"抢先体验版 - 教你一步步搭建微信小游戏开发环境 -- 基于Cocos2d-x","slug":"教你一步一步搭建微信小游戏开发环境","date":"2017-12-30T11:05:19.000Z","updated":"2017-12-30T11:55:42.000Z","comments":true,"path":"2017/12/30/教你一步一步搭建微信小游戏开发环境/","link":"","permalink":"http://yoursite.com/2017/12/30/教你一步一步搭建微信小游戏开发环境/","excerpt":"","text":"前言相信这两天大家都被微信推出的小游戏刷屏了吧。大家比较熟知的可能是“跳一跳”，但是其实微信首发了15款游戏，其中8款游戏用的是 Cocos 游戏引擎。下面为大家介绍一下 Windows 64 平台下如何搭建基于 Cocos2d-x 的小游戏开发环境。 准备 Cocos 开发工具 Cocos Creator 1.8 微信开发者工具 1.02.1712280 安装时直接选择下一步即可。注意目前最新的微信开发者工具是12月28号的，可以直接用我上面给出的链接去下载。 过程一、Cocos Creator 部分 打开 CocosCreator （第一次打开需要登录cocos的账号，可自行申请，略），新建一个工程。这里我们建一个 Hello World 的工程。Hello World 工程打开后的效果如下： 设置微信开发者工具目录。这里注意选择的是安装文件夹，例如我的是–&gt; D:\\Program Files (x86)\\Tencent\\微信web开发者工具。另外 NDK，SDK，ANT 如果你配置过的话会自动识别，此处不讨论它们的安装配置。 构建工程。配置如图所示，需要注意 appId 的填写 ，本来需要在微信公众平台将小程序的类别设置为小游戏类目才可以正常运行，但是由于微信目前（截至2017-12-30）尚未开放小游戏的权限设置，个人开发者无法改为这个类别，公司认证账号暂时也不行，参考此链接。微信为了照顾想抢先体验小游戏开发的开发者准备了一个 appId: wx6ac3f5090a6b99c5 用于体验。所以现在可以先用此appId进行体验，等到以后微信开放了小游戏的申请后再更换回自己的appId。注意不要点 运行，目前微信开发者工具貌似有bug，如果直接点 运行，微信开发者工具将会报 “Error: 未找到入口 app.json 文件” 的错误。下面我们用手动的方式在微信开发者工具中打开项目。 二、微信开发者工具 部分 打开微信开发者工具。 选择 小程序项目 打开小游戏工程，项目目录为刚刚创建的 Cocos 工程目录下的 build\\wechatgame。 在微信开发者工具中预览效果。 扫码在微信中验证实际的效果。 参考资料 Cocos 官网 微信小程序开启游戏支持！你准备好了没？ Creator v1.8 ：微信小游戏开发教程 小游戏在微信开发者工具中的问题汇总（FAQ）","categories":[],"tags":[{"name":"小游戏","slug":"小游戏","permalink":"http://yoursite.com/tags/小游戏/"}]}]}